[
  {
    "id": "blazor-erp",
    "title": "Custom ERP System with Blazor Server",
    "description": "An in-house ERP system built with Blazor Server to replace MyFactory",
    "details": "A comprehensive ERP system developed with Blazor Server, featuring Active Directory integration and seamless compatibility with the existing MyFactory system.",
    "type": "Professional",
    "category": "Web Application",
    "year": "2022",
    "previewImage": "/projects/blazor-erp/1.png",
    "images": [
      "/projects/blazor-erp/1.png",
      "/projects/blazor-erp/2.png",
      "/projects/blazor-erp/3.png",
      "/projects/blazor-erp/4.png"
    ],
    "technologies": [
      "CSS",
      "HTML",
      "Blazor",
      "SSR",
      "Figma",
      "JavaScript",
      "REST API"
    ],
    "links": [],
    "objectiveDetails": [
      "The previous ERP system MyFactory was to be gradually replaced by a new ERP system developed in-house based on Blazor Server."
    ],
    "projectDetails": [
      "Since both the old system MyFactory and the new system are to be operated in parallel, they must be compatible with each other and data must be stored in the same backend.",
      "Users must be able to log in via Active Directory and are assigned various user rights via login.",
      "With Blazor and the .Net stack a lot is possible, but to manipulate the DOM directly you have to work with Javascript interop.",
      "Given the large number of possible operations that an ERP system offers, it is very important to integrate these carefully into a UI so that users do not feel overwhelmed by the sheer abundance and the system can be operated intuitively."
    ]
  },
  {
    "id": "flutter-game-of-life",
    "title": "Flutter Game of Life",
    "description": "A cellular automaton game implemented in Flutter.",
    "details": "An intuitive Game of Life built with Flutter, featuring a speed slider to control simulation speed.",
    "type": "Private",
    "category": "Mobile Application",
    "year": "2022",
    "previewImage": "/projects/flutter-gol/1.jpg",
    "images": [
      "/projects/flutter-gol/1.jpg",
      "/projects/flutter-gol/2.jpg",
      "/projects/flutter-gol/3.jpg"
    ],
    "technologies": ["Flutter", "Cross Platform", "Dart"],
    "links": [
      {
        "description": "GitHub Repository",
        "url": "https://github.com/FranktheFurter/game_of_life_flutter",
        "icon": "i-mdi-github"
      },
      {
        "description": "Demo",
        "url": "https://frankthefurter.github.io/game_of_life_flutter/#/",
        "icon": "i-mdi-github"
      }
    ],
    "objectiveDetails": [
      "Tame of Life is my 'Goto-Project' to learn a new programming language or framework."
    ],
    "projectDetails": [
      "I have always been fascinated by the Game of Life, a simple cellular automaton with complex emergent behaviors. Over the years, I have implemented it in many programming languages and frameworks, but my favorite implementation is the one I built using Flutter. The Flutter framework provides an intuitive and expressive way to build beautiful and responsive user interfaces, which made implementing the Game of Life a breeze. I also added a speed slider that allows users to adjust the speed of the simulation, making it easier to observe the evolution of the cells.",
      "If you're interested in trying out the Flutter implementation of the Game of Life, you can do so by following the link provided."
    ]
  },
  {
    "id": "holodraw",
    "title": "HoloDraw - Bachelor's Thesis",
    "description": "A VR drawing system bridging freedom and precision for artists.",
    "details": "Developed as a Bachelor's thesis, HoloDraw combines mid-air VR drawing with constrained 2D input.",
    "type": "Private",
    "category": "Virtual Reality",
    "year": "2021",
    "previewImage": "/projects/holodraw/1.png",
    "images": [
      "/projects/holodraw/1.png",
      "/projects/holodraw/2.png",
      "/projects/holodraw/3.png"
    ],
    "technologies": ["Unity", "VR", "Motion Capture", "C#", "3D", "OptiTrack"],
    "links": [],
    "objectiveDetails": [
      "HoloDraw, my Bachelor's thesis, aims to bridge the gap between the freedom of VR drawing and the precision of constrained 2D input, offering a unique solution for artists and designers in a virtual reality environment."
    ],
    "projectDetails": [
      "HoloDraw extends VRSketchIn, a VR drawing system, by introducing a dynamic drawing layer that follows the tablet's position and orientation, translating 2D input to 3D space in VR.",
      "The project aims to bridge the gap between the freedom of VR drawing and the precision of constrained 2D input, offering a unique solution for artists and designers.",
      "An analysis of existing VR drawing systems revealed a compromise between freedom and precision, which HoloDraw addresses by combining mid-air drawing and constrained 2D input.",
      "The concept of a dynamic drawing layer has been explored in other design systems, and HoloDraw adapts this concept to a VR drawing context.",
      "The development process of HoloDraw includes analyzing existing systems, deriving the concept, implementation, and evaluation to create a seamless and precise drawing experience in VR."
    ]
  },
  {
    "id": "hardcore-writer",
    "title": "Hardcore Writer",
    "description": "A writing app inspired by the Most Dangerous Writing App",
    "details": "Hardcore Writer deletes text if you stop typing, built as a learning project in Flutter.",
    "type": "Private",
    "category": "Mobile Application",
    "year": "2022",
    "previewImage": "/projects/hardcore-writer/1.png",
    "images": [
      "/projects/hardcore-writer/1.png",
      "/projects/hardcore-writer/2.png",
      "/projects/hardcore-writer/3.png"
    ],
    "technologies": ["Flutter", "Cross Platform", "Dart"],
    "links": [
      {
        "description": "GitHub Repository",
        "url": "https://github.com/FranktheFurter/hardcore_writer",
        "icon": "i-mdi-github"
      },
      {
        "description": "Demo",
        "url": "https://frankthefurter.github.io/hardcore_writer/#/",
        "icon": "i-mdi-github"
      }
    ],
    "objectiveDetails": [
      "Hardcore Writer is inspired by the Most Dangerous Writing App which is a web application for free writing that combats writer's block by deleting all progress if the user stops typing for five seconds."
    ],
    "projectDetails": [
      "Introducing Hardcore Writer, a unique and thrilling writing app inspired by the Most Dangerous Writing App. As a budding developer, I wanted to take up the challenge of creating my own version of this incredible tool to learn Flutter better. Hardcore Writer is my free version of the app, designed to offer the same exciting writing experience with a personalized touch.",
      "With Hardcore Writer, you can unleash your creativity and let your thoughts flow freely without the fear of losing your work. The app allows you to set your writing session with two customizable features - interval time and session length. The interval time is the duration between your last keystroke and when your text gets deleted, while the session length is the overall duration of your writing session. You can choose the values for both these features according to your preference.",
      "The app interface is user-friendly, with the timer displayed on the top right corner of the screen. You can keep track of the time remaining for your session and the time left before your text gets deleted. This feature adds an extra layer of excitement to your writing, making every moment count and encouraging you to keep writing.",
      "So, what are you waiting for? Try Hardcore Writer now with the link of the left side and take the first step towards improving your writing skills."
    ]
  },
  {
    "id": "neoblo",
    "title": "Neoblo - Warehouse Management System with Flutter",
    "description": "A stable, cross-platform warehouse management system built with Flutter.",
    "details": "A client-requested warehouse management system developed with Flutter and MobX.",
    "type": "Professional",
    "category": "Mobile Application",
    "year": "2022",
    "previewImage": "/projects/neoblo/1.png",
    "images": [
      "/projects/neoblo/1.png",
      "/projects/neoblo/2.png",
      "/projects/neoblo/3.png"
    ],
    "technologies": [
      "Flutter",
      "Cross Platform",
      "Dart",
      "Azure",
      "REST API",
      "C#",
      ".NET Backend"
    ],
    "links": [],
    "objectiveDetails": [
      "The objective of this project was to replace an unstable warehouse management system with a new and efficient system that met all client requirements, using Flutter as the perfect cross-platform framework and MobX for state management."
    ],
    "projectDetails": [
      "Replaced the old warehouse management system with a new one, as the old one was unstable.",
      "Flutter was chosen due to its good performance on low-end Android scanners and its ability to be used by a few on web browsers, making it the perfect cross-platform framework.",
      "Used MobX for state management to ensure stability.",
      "The project was a success, as the old system was replaced with a new one that was more stable, efficient and user-friendly.",
      "The decision to use Flutter and MobX proved to be the right one, and the end result was a system that met all of the client's requirements and expectations."
    ]
  },
  {
    "id": "spareparts-webshop",
    "title": "Composable Spareparts Webshop",
    "description": "A modular webshop system for spare parts.",
    "details": "Built as a composable solution to replace an unstable warehouse management system.",
    "type": "Professional",
    "category": "Web Application",
    "year": "2023",
    "previewImage": "/projects/spareparts-webshop/1.png",
    "images": [
      "/projects/spareparts-webshop/1.png",
      "/projects/spareparts-webshop/2.png",
      "/projects/spareparts-webshop/3.png",
      "/projects/spareparts-webshop/4.png",
      "/projects/spareparts-webshop/5.png",
      "/projects/spareparts-webshop/6.png"
    ],
    "technologies": [
      "SSR",
      "Vue",
      "Nuxt",
      "Tailwind",
      "HTML",
      "CSS",
      ".NET Backend",
      "TypeScript"
    ],
    "links": [],
    "objectiveDetails": [
      "The objective of this project was to replace an unstable warehouse management system with a new and efficient system that met all client requirements, using Flutter as the perfect cross-platform framework and MobX for state management."
    ],
    "projectDetails": ["TODO"]
  },
  {
    "id": "monteur-portal",
    "title": "Monteur Portal with Flutter",
    "description": "A Flutter-based portal for technicians.",
    "details": "A web application for field technicians, built using Flutter and .NET backend.",
    "type": "Professional",
    "category": "Web Application",
    "year": "2022",
    "previewImage": "/projects/monteur-portal/1.png",
    "images": [
      "/projects/monteur-portal/1.png",
      "/projects/monteur-portal/2.png",
      "/projects/monteur-portal/3.png",
      "/projects/monteur-portal/4.png"
    ],
    "technologies": ["Flutter", ".NET Backend", "Cross Platform", "REST API"],
    "links": [],
    "objectiveDetails": ["TODO"],
    "projectDetails": ["TODO"]
  },
  {
    "id": "spotify-playlist-analyzer",
    "title": "Spotify Playlist Analyzer with Nuxt",
    "description": "A Nuxt-based web app to analyze Spotify playlists.",
    "details": "Provides insights on Spotify playlists using Vue and Nuxt framework.",
    "type": "Private",
    "category": "Web Application",
    "year": "2022",
    "previewImage": "/projects/spotify-playlist-analyzer/1.png",
    "images": [
      "/projects/spotify-playlist-analyzer/1.png",
      "/projects/spotify-playlist-analyzer/2.png"
    ],
    "technologies": [
      "Nuxt",
      "Vue",
      "REST API",
      "HTML",
      "CSS",
      "Tailwind",
      "TypeScript"
    ],
    "links": [],
    "objectiveDetails": ["TODO"],
    "projectDetails": ["TODO"]
  }
]
